finance_tracker/app/controllers/dashboard_controller.rb

SELECT SUM("incomes"."amount") FROM "incomes" WHERE "incomes"."user_id" = $1 AND "incomes"."date" BETWEEN $2 AND $3  [["user_id", 2], ["date", "2026-01-01"], ["date", "2026-01-31"]]
SELECT SUM("expenses"."amount") FROM "expenses" WHERE "expenses"."user_id" = $1 AND "expenses"."date" BETWEEN $2 AND $3  [["user_id", 2], ["date", "2026-01-01"], ["date", "2026-01-31"]]
---
  def index
    @current_month = params[:month] ? Date.parse(params[:month]) : Date.current

    # Monthly totals from Income and Expense models
    @income = current_user.incomes.for_month(@current_month).sum(:amount)
    @expenses = current_user.expenses.for_month(@current_month).sum(:amount)