finance_tracker/app/controllers/recurring_payments_controller.rb

INSERT INTO "recurring_payments" ("user_id", "name", "transaction_type", "amount", "day_of_month", "next_run_on", "active", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"
---
  def create
    @recurring_payment = current_user.recurring_payments.build(recurring_payment_params)

    if @recurring_payment.save

SELECT "recurring_payments".* FROM "recurring_payments" WHERE "recurring_payments"."user_id" = $1 AND "recurring_payments"."id" = $2 LIMIT $3  [["user_id", 1], ["id", 1], ["LIMIT", 1]]
---
  def set_recurring_payment
    @recurring_payment = current_user.recurring_payments.find(params[:id])