finance_tracker/app/controllers/sessions_controller.rb

SELECT "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "demo@example.com"], ["LIMIT", 1]]
---
  def create
    user = User.find_by(email: params[:email]&.downcase)