finance_tracker/app/controllers/transactions_controller.rb

SELECT 1 AS one FROM "transactions" WHERE "transactions"."user_id" = $1 AND "transactions"."date" BETWEEN $2 AND $3 LIMIT $4  [["user_id", 1], ["date", "2026-01-01"], ["date", "2026-01-31"], ["LIMIT", 1]]
---
  def index
    @transactions = current_user.transactions.recent

    # Filter by month
    if params[:month].present?
      month_date = Date.parse("#{params[:month]}-01") rescue Date.current
      @transactions = @transactions.for_month(month_date)
    else
      @transactions = @transactions.for_month(Date.current)
    end

    # Filter by type
    @transactions = @transactions.by_type(params[:type]) if params[:type].present?

INSERT INTO "transactions" ("user_id", "transaction_type", "amount", "date", "description", "category", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"
---
  def create
    @transaction = current_user.transactions.build(transaction_params)

    if @transaction.save

SELECT "transactions".* FROM "transactions" WHERE "transactions"."user_id" = $1 AND "transactions"."id" = $2 LIMIT $3  [["user_id", 1], ["id", 1], ["LIMIT", 1]]
---
  def set_transaction
    @transaction = current_user.transactions.find(params[:id])